OpenNuvoton/M55M1BSP/SampleCode/StdDriver/SPIM_OctalMode_Flash/main.c
        // Update the range if the current range is longer than the previous one
        if (u32j >= u8MaxRang)
        {
            u8StartIdx = u8Find;
            u8MaxRang = u32j;
        }
    }

    return (u8MaxRang > 2) ?
           au8Src[((u8StartIdx + u8MaxRang / 2) + (((u8MaxRang % 2) != 0) ? 1 : 0)) - 1] :
           au8Src[u8StartIdx];
}

void SPIM_TrimDLLDelayNum(SPIM_T *spim, SPIM_PHASE_T *pMTWrCMD, SPIM_PHASE_T *pMTRdCMD)
{
    uint8_t u8RdDelay = 0;
    uint8_t u8RdDelayRes[SPIM_MAX_DLL_LATENCY] = {0};
    uint32_t u32PatternSize = TRIM_PAT_SIZE;
    uint32_t u32ReTrimMaxCnt = 6;
    uint32_t u32LoopAddr = 0;
    uint32_t u32Val = 0;
    uint32_t u32i = 0;
    uint32_t u32j = 0;
    uint32_t u32k = 0;
    uint32_t u32ReTrimCnt = 0;
    uint32_t u32SrcAddr = OCFLH_TRIM_ADDR;
    /*
        SPIM DMA requires memory buffers to be 8-byte aligned.
        TRIM_PAT_SIZE is in bytes and must be divisible by 8.
    */
    uint64_t au64TrimPattern[(TRIM_PAT_SIZE * 2) / 8] = {0};
    uint64_t au64VerifyBuf[TRIM_PAT_SIZE / 8] = {0};
    uint8_t *pu8TrimPattern = (uint8_t *)au64TrimPattern;
    uint8_t *pu8VerifyBuf = (uint8_t *)au64VerifyBuf;
    uint32_t u32DMMAddr = SPIM_GET_DMMADDR(spim);
    SPIM_PHASE_T sMTRdCMDTmp = {0};

    /* Create Trim Pattern */
    for (u32k = 0; u32k < sizeof(au64TrimPattern); u32k++)
    {
        u32Val = (u32k & 0x0F) ^ (u32k >> 4) ^ (u32k >> 3);

        if (u32k & 0x01)
        {
            u32Val = ~u32Val;
        }

        pu8TrimPattern[u32k] = ~(uint8_t)(u32Val ^ (u32k << 3) ^ (u32k >> 2));
    }

    SPIM_EnterOPIMode_MICRON(spim);

    SPIM_EraseBlock(spim,
                    u32SrcAddr,
                    (pMTWrCMD->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE,
                    OPCODE_SE_4K,
                    SPIM_PhaseModeToNBit(pMTWrCMD->u32CMDPhase),
                    SPIM_OP_ENABLE);

    SPIM_DMA_Write(spim,
                   u32SrcAddr,
                   ((pMTWrCMD->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE),
                   sizeof(au64TrimPattern),
                   pu8TrimPattern,
                   pMTWrCMD->u32CMDCode);

    memcpy((uint8_t *)&sMTRdCMDTmp, (uint8_t *)pMTRdCMD, sizeof(SPIM_PHASE_T));

    if ((pMTRdCMD->u32RDQS == SPIM_OP_ENABLE) && (pMTRdCMD->u32CMDPhase != PHASE_OCTAL_MODE))
    {
        pMTRdCMD->u32CMDPhase = PHASE_OCTAL_MODE;
        pMTRdCMD->u32CMDWidth = PHASE_WIDTH_16;
        pMTRdCMD->u32CMDDTR = PHASE_ENABLE_DTR;

        pMTRdCMD->u32AddrPhase = PHASE_OCTAL_MODE;
        pMTRdCMD->u32AddrWidth = PHASE_WIDTH_32;
        pMTRdCMD->u32AddrDTR = PHASE_ENABLE_DTR;

        pMTRdCMD->u32DataPhase = PHASE_OCTAL_MODE;
        pMTRdCMD->u32DataDTR = PHASE_ENABLE_DTR;
        pMTRdCMD->u32RDQS = SPIM_OP_ENABLE;
        pMTRdCMD->u32DcNum = 16;
    }

    SPIM_DMADMM_InitPhase(spim, pMTRdCMD, SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_DMADMM_InitPhase(spim, pMTRdCMD, SPIM_CTL0_OPMODE_DIRECTMAP);

    for (u32ReTrimCnt = 0; u32ReTrimCnt < u32ReTrimMaxCnt; u32ReTrimCnt++)
    {
        u32LoopAddr = 0;

        for (u8RdDelay = 0; u8RdDelay < SPIM_MAX_DLL_LATENCY; u8RdDelay++)
        {
            /* Set DLL calibration to select the valid delay step number */
            SPIM_SetDLLDelayNum(spim, u8RdDelay);

            memset(pu8VerifyBuf, 0, TRIM_PAT_SIZE);

            /* Calculate the pattern size based on the trim count */
            u32PatternSize =
                (((u32ReTrimCnt == 2) || (u32ReTrimCnt >= 3)) && (u8RdDelay == 0)) ?
                (TRIM_PAT_SIZE - 0x08) :
                TRIM_PAT_SIZE;

            /* Read data from the HyperRAM */
            u32LoopAddr = 0;

            for (u32k = 0; u32k < u32PatternSize; u32k += 0x08)
            {
#if (NVT_DCACHE_ON == 1)
                // Invalidate the data cache for the source or DMM address
                SCB_InvalidateDCache_by_Addr(
                    (volatile uint32_t *)((u32ReTrimCnt == 1) ? u32SrcAddr : (u32DMMAddr + u32SrcAddr)),
                    (int32_t)TRIM_PAT_SIZE * 2);
#endif

                if (u32ReTrimCnt == 1)
                {
                    SPIM_DMA_Read(SPIM_PORT,
                                  (u32SrcAddr + u32LoopAddr),
                                  (pMTRdCMD->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE,
                                  0x08,
                                  &pu8VerifyBuf[u32k],
                                  pMTRdCMD->u32CMDCode,
                                  SPIM_OP_ENABLE);
                }
                else
                {
                    SPIM_EnterDirectMapMode(spim,
                                            (pMTRdCMD->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE,
                                            pMTRdCMD->u32CMDCode,
                                            1);

                    /* Read 8 bytes of data from the HyperRAM */
                    *(volatile uint64_t *)&pu8VerifyBuf[u32k] = *(volatile uint64_t *)(u32DMMAddr + u32SrcAddr + u32LoopAddr);
                    //*(volatile uint32_t *)&pu8VerifyBuf[u32k + 4] = *(volatile uint32_t *)(u32DMMAddr + u32SrcAddr + u32LoopAddr + 4);
                }

                if ((u32i = memcmp(&pu8TrimPattern[u32LoopAddr], &pu8VerifyBuf[u32k], 0x08)) != 0)
                {
                    break;
                }

                u32LoopAddr += (u32ReTrimCnt >= 3) ? 0x10 : 0x08;
            }

            u8RdDelayRes[u8RdDelay] += ((u32i == 0) ? 1 : 0);
        }
    }

    /* Set Octal Flash Write Enable*/
    memcpy((uint8_t *)pMTRdCMD, (uint8_t *)&sMTRdCMDTmp, sizeof(SPIM_PHASE_T));

    SPIM_DMADMM_InitPhase(spim, pMTRdCMD, SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_DMADMM_InitPhase(spim, pMTRdCMD, SPIM_CTL0_OPMODE_DIRECTMAP);

    SPIM_ExitOPIMode_MICRON(spim);

    u32j = 0;

    for (u32i = 0; u32i < SPIM_MAX_RX_DLY_NUM; u32i++)
    {
        if (u8RdDelayRes[u32i] >= u32ReTrimMaxCnt)
        {
            u8RdDelayRes[u32j++] = u32i;
        }
    }

    u8RdDelay = (u32j < 2) ? u8RdDelayRes[0] : isConsecutive(u8RdDelayRes, u32j);

