OpenNuvoton/M55M1BSP/SampleCode/StdDriver/SPIM_OctalMode_Flash/main.c
    /*
     *  Program data to flash block
     */
    printf("Program sequential data to flash block 0x%x...", TEST_BLOCK_ADDR);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        pData = (uint32_t *)g_buff;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            (*pData) = (i << 16) | (TEST_BLOCK_ADDR + offset + i);
        }

#if (NVT_DCACHE_ON == 1)
        SCB_CleanDCache_by_Addr((volatile uint8_t *)&g_buff, (uint32_t)sizeof(g_buff));
#endif

        SPIM_DMA_Write(SPIM_PORT, TEST_BLOCK_ADDR + offset, u32Is4ByteAddr, BUFFER_SIZE, g_buff, WrCmd);
    }

    printf("done.\n");

    /*
     *  Verify flash block data
     */
    printf("Verify SPI flash block 0x%x data...", TEST_BLOCK_ADDR);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(g_buff, 0, BUFFER_SIZE);

#if (NVT_DCACHE_ON == 1)
        SCB_InvalidateDCache_by_Addr((volatile uint8_t *)&g_buff, (uint32_t)sizeof(g_buff));
#endif

        SPIM_DMA_Read(SPIM_PORT, TEST_BLOCK_ADDR + offset, u32Is4ByteAddr, BUFFER_SIZE, g_buff, u32RdCmd, SPIM_OP_ENABLE);

        pData = (uint32_t *)&g_buff[0];

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if ((*pData) != (((i << 16) | (TEST_BLOCK_ADDR + offset + i)) & 0xFFFFFFFF))
            {
                uint32_t u32CmpData = ((i << 16) | (TEST_BLOCK_ADDR + offset + i));

                printf("FAILED!\n");
                printf("Flash address 0x%x, read 0x%x, expect 0x%x!\n",
                       TEST_BLOCK_ADDR + i,
                       *pData,
                       u32CmpData);
                return -1;
            }
        }
    }

    printf("done.\n");

    return 0;
}

int main()
{
    uint8_t idBuf[3];
    uint32_t u32Is4ByteAddr = 0;

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Init Debug UART to 115200-8N1 for print message */
    InitDebugUart();

    printf("+------------------------------------------------------------------------+\n");
    printf("|      SPIM DMA mode read/write octal flash(Micron MT35XU02G) sample     |\n");
    printf("+------------------------------------------------------------------------+\n");

    /**
     * @brief Set SPIM clock as HCLK divided by 1
     * @note  Octal flash in DDR mode only support 1 or 2.
     */
    SPIM_SET_CLOCK_DIVIDER(SPIM_PORT, SPIM_PORT_DIV);

    if (SPIM_InitFlash(SPIM_PORT, SPIM_OP_ENABLE) != SPIM_OK)          /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        goto lexit;
    }

    SPIM_ReadJedecId(SPIM_PORT, idBuf, sizeof(idBuf), SPIM_BITMODE_1);
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n",
           idBuf[0], idBuf[1], idBuf[2]);

    printf("\n[Fast IO Read] 3-bytes address mode, Fast Read Octal SDR command...\r\n");

    SPIM_DMADMM_InitPhase(SPIM_PORT, &gsMtCBhRdCMD, SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_DMADMM_InitPhase(SPIM_PORT, &gsMtC2hWrCMD, SPIM_CTL0_OPMODE_PAGEWRITE);

    /* Trim delay cycle. Adjust the sampling clock of received data to latch the correct data. */
    SPIM_TrimRxClkDlyNum(SPIM_PORT, &gsMtC2hWrCMD, &gsMtCBhRdCMD);

    u32Is4ByteAddr = (gsMtCBhRdCMD.u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;

    if (dma_read_write(u32Is4ByteAddr, gsMtCBhRdCMD.u32CMDCode, gsMtC2hWrCMD.u32CMDCode, SPIM_OP_DISABLE) != SPIM_OK)
    {
        printf("  FAILED!!\n");
        goto lexit;
    }

    printf("[OK].\n");

    printf("\n[Fast IO Read] 4-bytes address mode, Fast Read Octal SDR command...\r\n");

    SPIM_DMADMM_InitPhase(SPIM_PORT, &gsMtCChRdCMD, SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_DMADMM_InitPhase(SPIM_PORT, &gsMt8EhWrCMD, SPIM_CTL0_OPMODE_PAGEWRITE);

    /* Trim delay cycle. Adjust the sampling clock of received data to latch the correct data. */
    SPIM_TrimRxClkDlyNum(SPIM_PORT, &gsMt8EhWrCMD, &gsMtCChRdCMD);

    u32Is4ByteAddr = (gsMtCChRdCMD.u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;

    if (dma_read_write(u32Is4ByteAddr, gsMtCChRdCMD.u32CMDCode, gsMt8EhWrCMD.u32CMDCode, SPIM_OP_DISABLE) != SPIM_OK)
    {
        printf("  FAILED!!\n");
        goto lexit;
    }

    printf("[OK].\n");

    printf("\n[Fast Read Output DDR Mode] 4-bytes address mode, Fast Read Octal DDR command...\r\n");

    SPIM_DMADMM_InitPhase(SPIM_PORT, &gsMt8BhRdDDRCMD, SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_DMADMM_InitPhase(SPIM_PORT, &gsMt02hWrDDRCMD, SPIM_CTL0_OPMODE_PAGEWRITE);

    /* Trim delay cycle. Adjust the sampling clock of received data to latch the correct data. */
    SPIM_TrimDLLDelayNum(SPIM_PORT, &gsMt02hWrDDRCMD, &gsMt8BhRdDDRCMD);

    u32Is4ByteAddr = (gsMt8BhRdDDRCMD.u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;

    SPIM_EnterOPIMode_MICRON(SPIM_PORT); /* Enable Octal Flash DDR Mode */

    if (dma_read_write(u32Is4ByteAddr, gsMt8BhRdDDRCMD.u32CMDCode, gsMt02hWrDDRCMD.u32CMDCode, SPIM_OP_ENABLE) != SPIM_OK)
    {
        printf("  FAILED!!\n");
        goto lexit;
    }

    SPIM_ExitOPIMode_MICRON(SPIM_PORT);  /* Disable Octal Flash DDR Mode */

    printf("[OK].\n");

    printf("\nOctal SPI Flash read/write demo done.\n");
lexit:

    /* Lock protected registers */
    SYS_LockReg();

    while (1);
}

/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/
